# Словари и множества.
# ================================================
# 2.Работа со словарями
#----------------------------------
my_dict={"Павел":1984,"Елена":1998}
print("Dict:",my_dict)                  # Обращение к словарю
print("Existing value:", my_dict["Елена"])         # Значение по существующему ключу
print("Not existing value:",my_dict.get("Иван"))                   # Обращение к не существующему ключу
my_dict.update( {"Юра":1975,
                "Нина":2005})    # Добавление в словарь 2 пары значений
print(my_dict)
a=my_dict.pop(("Елена"))         # Удаление пары по ключу
print(my_dict)
print("Deleted value:", a)                         # Вывод значения удаленной пары по ключу
print("Modified dictionary:", my_dict)                   # Вывод словаря
#------------------------------------------------------------------
# 2.Работа со множествами
#----------------------------------
my_set={4,7,True,"привет",False,7,False}  # множество
print("Set:",my_set)
print(my_set.add(9))                      # Добавление во множество
print(my_set.add(17))                     # Добавление во множество
print("Modified set:", my_set)
